John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
#include <stdint.h>
#include <EEPROM.h>
#include <ESP8266WiFi.h>
#include <Hash.h>
#include "spiConsole.cpp"
// #include "LittleFS.h"


void timeTicks(unsigned long timeInUs){
	while(timeInUs){ 
		_NOP();
		timeInUs--;
	}
	return;
}

#define calibratedFreq 100

#define devTick 15.2129f
#define devTickError 0.001f//0.000008f


#define argDataTypeMax 0xFFFFFFFF

#define delayUS(timeInUs) timeTicks((unsigned long)(((timeInUs*devTick)-((timeInUs*devTickError)*(timeInUs>calibratedFreq))+((timeInUs*devTickError)*(timeInUs<calibratedFreq)))))

#define _delay_us delayUS
#define _delay_ms delay
 
void microSec(unsigned long microSeconds){
	_delay_us(microSeconds);
}

#define WD_FEED //_delay_ms(0)

unsigned char WATCH_DOG_GLOBAL_TIMER=0;
#define _WDF //if(!(--WATCH_DOG_GLOBAL_TIMER))WD_FEED;

unsigned short WATCH_DOG_GLOBAL_TIMER_16BIT=0;
#define _WDSF //if(!(--WATCH_DOG_GLOBAL_TIMER_16BIT))WD_FEED;

#define _DW digitalWrite
#define _DR digitalRead
#define _PM pinMode




#define _TIMERINTERRUPT_LOGLEVEL_     1
#define USING_TIM_DIV1                false           // for shortest and most accurate timer
#define USING_TIM_DIV16               false           // for medium time and medium accurate timer
#define USING_TIM_DIV256              true            // for longest timer but least accurate. Default
#include "ESP8266TimerInterrupt.h"
#define TIMER_INTERVAL_MS       2700

ESP8266Timer ITimer;



// unsigned char interruptEnable=1;

void  TimerHandler(){
	// static unsigned char cycleCounter=4;
	// if(!(cycleCounter-=(cycleCounter!=0)))
	// 	delay(0);
	// if(interruptEnable){
		ESP.wdtFeed();
    // 	delay(0);
	// }
	// _NOP();
}
#define disableAutoReset() ITimer.attachInterruptInterval(TIMER_INTERVAL_MS * 1000, TimerHandler)
#define enableInt() //interruptEnable=1
#define disableInt() //interruptEnable=0




// #define fileSystem LittleFS

unsigned char UNDEFINED[10]="undefined";

#define lengthInBytes(object) (unsigned char *)(&object+1)-(unsigned char *)(&object)
unsigned long strToUint32(unsigned char *str) {
	unsigned char coun = 0;
	unsigned long num;
	while (*str) {
		if (((*str) > 0x2F) && ((*str) < 0x3A)) {
			if (!coun)
				num =(unsigned) str;
			coun++;
		}
		else if (coun)
			break;
		str++;
	}
	if (!coun)
		return 0;
	str = (unsigned char*)num;
	unsigned long ret = 0;
	unsigned x = 1;
	while (coun) { //while (coun > 0)
		ret += (str[coun - 1] - 0x30)*x;
		x *= 10;
		coun--;
	}
	return ret;
}

#define HEX_CHARS(FOUR_BIT) (((FOUR_BIT+0x30)*(FOUR_BIT<10))|((FOUR_BIT+0x37)*(FOUR_BIT>9)))
void intToHex(unsigned long decimalFrom,unsigned char *hexaDecimalForm){
	CLR(hexaDecimalForm);
	unsigned char numLength=8-((((decimalFrom&0xFF000000UL)!=0)+((decimalFrom&0x00FF0000UL)!=0)+((decimalFrom&0x0000FF00UL)!=0)+1)*2);
	for(unsigned char i=numLength;i<8;i++){
		unsigned char fourBits=(unsigned char)((decimalFrom&((unsigned long)(0xf0000000>>(4*i))))>>(4*(7-i)));
		*hexaDecimalForm=HEX_CHARS(fourBits);
		hexaDecimalForm++;
	}
	return;
}






unsigned char inttostr(unsigned long num, unsigned char *str) {
	static unsigned char ucoun;
	for (unsigned char clrCoun = 0; clrCoun < ucoun; clrCoun++) {
		str[clrCoun] = 0;
	}
	ucoun = 0;
	if (num) {
		unsigned long sum = 0;
		unsigned long r = 10000000;
		for (unsigned char i = 0; i < 8; i++) {
			unsigned char flg = 0;
			for (unsigned char j = 9; j > 0; j--) {
				if ((num - sum) >= r * j) {
					sum += r * j;
					*str = (j)+0x30;
					ucoun++;
					str++;
					flg = 1;
					break;
				}
			}
			if (flg == 0 && sum != 0) {
				*str = 0x30;
				ucoun++;
				str++;
			}
			r /= 10;
		}
	}
	else {
		*str = 0x30;
		ucoun = 1;
	}
	return ucoun;
}



unsigned char globalStringNameThatYouWillNeverUse[11]="";
unsigned char* inttostring(unsigned long num) {
	CLR(globalStringNameThatYouWillNeverUse);
	inttostr(num, globalStringNameThatYouWillNeverUse);
	return globalStringNameThatYouWillNeverUse;
}

unsigned char *intToHexaDecimal(unsigned long num){
	unsigned char *makeStr=globalStringNameThatYouWillNeverUse;
	*makeStr=0x30;
	makeStr++;
	*makeStr=0x78;
	makeStr++;
	intToHex(num,makeStr);
	return globalStringNameThatYouWillNeverUse;
}


#define C_HEX intToHexaDecimal
#define C_INT inttostring


unsigned char* longToString(long num){
	unsigned char *signedStr=globalStringNameThatYouWillNeverUse;
	if(num<0){
		*signedStr=0x2D;
		signedStr++;
		num*=(-1);
	}
	inttostr((unsigned long)num, signedStr);
	return globalStringNameThatYouWillNeverUse;
}


unsigned strint(unsigned char *str){
	unsigned ret=0;
	unsigned char coun=0;
	while((str[coun])&&(str[coun]>0x2F)&&(str[coun]<0x3A)){
		coun++;
	}
	unsigned x=1;
	while(coun>0){
		ret+=(str[coun-1]-0x30)*x;
		x*=10;
		coun--;
	}
	return ret;
}

uint64_t getInt(unsigned char *numStr){
	unsigned char numLength=stringCounter(numStr);
	uint64_t result=0;
	uint64_t factor=1;
	while(numLength--){
		result+=(numStr[numLength]-0x30)*factor;
		factor*=10;
	}
	return result;
}

unsigned char UNDEFINED_VALUE=0;
unsigned char *NO_DATA=&UNDEFINED_VALUE;


unsigned short stringCounter(unsigned char *counted){
	unsigned short counter=0;
	while(*counted){
		counter++;
		counted++;
	}
	return counter;
}

unsigned short CLR_LENGTH=0;									//this value will be reseted to zero after clearing the string/uint_8 pointer
unsigned char * CLR(unsigned char *deletedString){
	unsigned char *returnedString=deletedString;
	while(*deletedString||(CLR_LENGTH-=(CLR_LENGTH!=0))){
		*deletedString=0;
		deletedString++;	
	}
	return returnedString;
}

unsigned char equalStrings(unsigned char *stringPointer1,unsigned char *stringPointer2){
	unsigned short diffCounter;
	if((diffCounter=stringCounter(stringPointer1))!=stringCounter(stringPointer2))
		return 0;
	while((stringPointer1[--diffCounter]==stringPointer2[diffCounter])&&diffCounter)
	return !diffCounter;
}

unsigned char *_CS(unsigned char *bigString,unsigned char *smallString){
	unsigned char *smallStringLocation=bigString+stringCounter(bigString);		// lucky for us c/c++ support pointer arthematic
	while(*smallString){
		*smallStringLocation=*smallString;
		smallString++;
		smallStringLocation++;
	}
	return bigString;
}

// unsigned char ARRAY_OF_INDEX_GLOBAL[13]="";
// unsigned char *listIndex(unsigned long indexOFArray){
// 	CLR(ARRAY_OF_INDEX_GLOBAL);
// 	unsigned char mkStringCounter=0;
// 	ARRAY_OF_INDEX_GLOBAL[mkStringCounter]=0X5B; // square bracket openning
// 	unsigned char *indexOFArrayString=inttostring(indexOFArray);
// 	while(*indexOFArrayString){_WDF;
// 		ARRAY_OF_INDEX_GLOBAL[++mkStringCounter]=*indexOFArrayString;
// 		indexOFArrayString++;
// 	}
// 	ARRAY_OF_INDEX_GLOBAL[++mkStringCounter]=0x5D;	//square bracket closing
// 	return ARRAY_OF_INDEX_GLOBAL;
// }

