John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
unsigned char *tcps(unsigned char *rawText,unsigned char *keyStr,unsigned char *cipherText){
	base64(dataMask(rawText,keyStr),cipherText);
	return cipherText;
}

unsigned long long encKey64(unsigned char *base256Str){
	unsigned char encKeyCounter=0;
	unsigned long long key64Bit=0;
	while(encKeyCounter<8)
		key64Bit|=base256Str[encKeyCounter++]<<(64-(encKeyCounter*8));
	return key64Bit;
}



unsigned char asciiHex(unsigned char *base16){
	unsigned char res=0;
	for(unsigned char i=0;i<2;i++){
		//res=res<<4;
		if(((*base16)>0x2F)&&((*base16)<0x3A)){
			res=res<<4;
			res+=(*base16)-0x30;
		}
		else if(((*base16)>0x60)&&((*base16)<0x67)){
			res=res<<4;
			res+=(*base16)-0x57;
		}
		else if(((*base16)>0x40)&&((*base16)<0x47)){
			res=res<<4;
			res+=(*base16)-0x37;
		}
		base16++;
	}
	return res;
}




unsigned char validHex(unsigned char *base16){
	return((((*base16)>0x2F)&&((*base16)<0x3A))||(((*base16)>0x60)&&((*base16)<0x67))||(((*base16)>0x40)&&((*base16)<0x47)));
}




unsigned char *URIdecode(unsigned char *url){ //this fuction will work without checking if the the chars followed by the percentage char is valid
	unsigned char *originalLocation=url;
	unsigned char *shift;
	unsigned char *allocate;
	while(*url){
		if((*url)==0x25){
			shift=url+1;
			//if(validHex(shift)){
				(*url)=asciiHex(shift);
				allocate=shift+2;
				while(*allocate){
					(*shift)=(*allocate);
					(*allocate)=0;
					allocate++;
					shift++;
				}
			//}
		}
		url++;
	}
	return originalLocation;
}





#define clkPinNum 16
#define dataPinNum 10



void clk(unsigned char state){
	_DW(clkPinNum,state);
}

void data(unsigned char state){
	_DW(dataPinNum,state);
}

#define spiConsoleClk 16
#define spiConsoleData 10

#define shiftRegisterData 16
#define shiftRegisterClk 5
#define shiftRegisterLatch 4

void spiConsoleSetup(void){
	_PM(spiConsoleClk,OUTPUT);
	_PM(spiConsoleData,OUTPUT);
	_DW(spiConsoleData,1);
	_DW(spiConsoleClk,0);

	_PM(shiftRegisterClk,OUTPUT);
	_PM(shiftRegisterLatch,OUTPUT);
	_DW(shiftRegisterClk,0);
	_DW(shiftRegisterLatch,0);
	
	return;
}





const float SPI_CONSOLE_SPEED=(1e6f/360000)/2;			//max is 1.2Mbps

unsigned char *spiConsoleLog(unsigned char *consoleData){
	unsigned char *loggedData=consoleData;
	_DW(spiConsoleData,0);
	_delay_us(60);										//to sync with the receiver
	while(*consoleData){
		unsigned char spiBitCounter=8;
		while(spiBitCounter--){
			_DW(spiConsoleData,((*consoleData&(1<<spiBitCounter))!=0));
			_delay_us(SPI_CONSOLE_SPEED*0.4);
			_DW(spiConsoleClk,1);
			_delay_us(SPI_CONSOLE_SPEED);
			_DW(spiConsoleClk,0);
			_delay_us(SPI_CONSOLE_SPEED*0.6);
		}
		consoleData++;
	}
	_DW(spiConsoleData,1);
	return loggedData;
}






#define consoleLog(inputStringToConsole) spiConsoleLog((unsigned char *)inputStringToConsole)
#define cout_hex(coutStr,coutNum) consoleLog(coutStr); consoleLog(C_HEX(coutNum)); consoleLog("\r\n");
#define COUT_HEX cout_hex
#define cout_int(coutStr,coutNum) consoleLog(coutStr); consoleLog(C_INT(coutNum)); consoleLog("\r\n");
#define COUT_INT cout_int
#define consoleDebug(VARIABLE_X) consoleLog("\n"); consoleLog(#VARIABLE_X); consoleLog(" >> "); consoleLog(C_INT(VARIABLE_X)); consoleLog("\n"); 
#define _endl "\r\n"

#define systemLog(consoleLogText0) consoleLog("\n<div style=\"color: yellow;\">");consoleLog(consoleLogText0);consoleLog("</div>");
#define systemError(consoleLogText1) consoleLog("\n<div style=\"color: red;\">");consoleLog(consoleLogText1);consoleLog("</div>");




unsigned char GLOBAL_IPADDRESS_VARIABLE_NAME[16]="";
unsigned char * ipAddressString(IPAddress deviceIP){
		unsigned char *ipString=GLOBAL_IPADDRESS_VARIABLE_NAME;
	while(*ipString){
		*ipString=0;
		ipString++;
	}
	ipString=GLOBAL_IPADDRESS_VARIABLE_NAME;
	unsigned char byteCounter=0;
	byteCounterEqual4:
	unsigned char *byteCounterString=inttostring((unsigned long)deviceIP[byteCounter]);
	while(*byteCounterString){
		*ipString=*byteCounterString;
		ipString++;
		byteCounterString++;
	}
	if(byteCounter!=3){
		byteCounter++;
		*ipString=0x2E;
		ipString++;
		goto byteCounterEqual4;
	}
	return GLOBAL_IPADDRESS_VARIABLE_NAME;  
}








#define MAX_EEPROM_SIZE 512U
#define SSID_MAX_LENGTH 32
#define WIFI_PASSWORD_MAX_LENGTH 63
#define WIFI_CONFIG 0

#define LINKER_CONFIG WIFI_CONFIG+SSID_MAX_LENGTH+WIFI_PASSWORD_MAX_LENGTH
#define LINKER_CONFIG_LENGTH 100

#define EXTERNAL_PORT_CONFIG LINKER_CONFIG+LINKER_CONFIG_LENGTH
#define EXTERNAL_PORT_LENGTH 8

#define EEPROM_BUFFER_SIZE 200
unsigned char EEPROM_BUFFER[EEPROM_BUFFER_SIZE]="";



unsigned char ssidSave(unsigned char *networkSSID){
	unsigned short startAddress=WIFI_CONFIG;
	while(startAddress<(WIFI_CONFIG+SSID_MAX_LENGTH)){
		EEPROM.write(startAddress&((MAX_EEPROM_SIZE-1)),*networkSSID);
		startAddress++;
		networkSSID+=(*networkSSID!=0);
	}
	return (unsigned char)EEPROM.commit();
}


unsigned char wifiPasswordSave(unsigned char *networkPassword){
	unsigned short startAddress=WIFI_CONFIG+SSID_MAX_LENGTH;
	while(startAddress<(WIFI_CONFIG+SSID_MAX_LENGTH+WIFI_PASSWORD_MAX_LENGTH)){
		EEPROM.write(startAddress&((MAX_EEPROM_SIZE-1)),*networkPassword);
		startAddress++;
		networkPassword+=(*networkPassword!=0);
	}
	return (unsigned char)EEPROM.commit();
}



unsigned char NETWORK_SSID[SSID_MAX_LENGTH+1]="";
unsigned char NETWORK_PASSWORD[WIFI_PASSWORD_MAX_LENGTH+1]="";

unsigned char *userSSID(void){
	unsigned char *getSSID=NETWORK_SSID;
	unsigned short startAddress=WIFI_CONFIG;
	while(startAddress<(WIFI_CONFIG+SSID_MAX_LENGTH)){
		*getSSID=EEPROM.read(startAddress);
		getSSID++;
		startAddress++;
	}
	return NETWORK_SSID;
}


unsigned char *userPassword(void){
	unsigned char *getPassword=NETWORK_PASSWORD;
	unsigned short startAddress=WIFI_CONFIG+SSID_MAX_LENGTH;
	while(startAddress<(WIFI_CONFIG+SSID_MAX_LENGTH+WIFI_PASSWORD_MAX_LENGTH)){
		*getPassword=EEPROM.read(startAddress);
		getPassword++;
		startAddress++;
	}
	return NETWORK_PASSWORD;
}

unsigned char linkerSave(unsigned char *linkerJson){
	unsigned short startAddress=LINKER_CONFIG;
	while(startAddress<(LINKER_CONFIG+LINKER_CONFIG_LENGTH)){
		EEPROM.write(startAddress&((MAX_EEPROM_SIZE-1)),*linkerJson);
		startAddress++;
		linkerJson+=(*linkerJson!=0);
	}
	return (unsigned char)EEPROM.commit();
}

unsigned char *linkerData(void){
	CLR_LENGTH=EEPROM_BUFFER_SIZE;
	CLR(EEPROM_BUFFER);
	unsigned char *getLinkerData=EEPROM_BUFFER;
	unsigned short startAddress=LINKER_CONFIG;
	while(startAddress<(LINKER_CONFIG+LINKER_CONFIG_LENGTH)){
		*getLinkerData=EEPROM.read(startAddress);
		getLinkerData++;
		startAddress++;
	}
	return EEPROM_BUFFER;
}

unsigned char *EXTERNAL_PORT_LAST_VALUE=EEPROM_BUFFER;
const float EXTERNAL_OUTPUT_SPEED=(1e6f/50000)/2;
unsigned char EXTERNAL_PORT_SET_COUNTER=1;

