John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
unsigned char *externalPort(void){
	static unsigned char externalPortOnChange;
	CLR_LENGTH=EEPROM_BUFFER_SIZE;
	CLR(EEPROM_BUFFER);
	unsigned char externalPortBuffer[EXTERNAL_PORT_LENGTH];
	unsigned char externalPortLength=EXTERNAL_PORT_LENGTH;
	while(externalPortLength--){
		externalPortBuffer[externalPortLength]=EEPROM.read(EXTERNAL_PORT_CONFIG+externalPortLength);
	}
	
	if(externalPortOnChange!=EXTERNAL_PORT_SET_COUNTER){
		externalPortLength=EXTERNAL_PORT_LENGTH;
		while(externalPortLength--){
			unsigned char shiftRegisterByte=EEPROM.read(EXTERNAL_PORT_CONFIG+externalPortLength);
			unsigned char bitCounter=8;
			while(bitCounter--){
				_DW(shiftRegisterData,(shiftRegisterByte&(1<<bitCounter)));
				_DW(shiftRegisterClk,1);
				_delay_us(EXTERNAL_OUTPUT_SPEED);
				_DW(shiftRegisterClk,0);
				_delay_us(EXTERNAL_OUTPUT_SPEED);
			}
		}
		_DW(shiftRegisterData,0);

		_DW(shiftRegisterLatch,1);
		_delay_us(EXTERNAL_OUTPUT_SPEED*10);
		_DW(shiftRegisterLatch,0);
		_delay_us(EXTERNAL_OUTPUT_SPEED);
	}
	externalPortOnChange=EXTERNAL_PORT_SET_COUNTER;

	unsigned char *getExternalPortObject=EEPROM_BUFFER;
	const char *constExternalPortObjectStart="{\"externalPort\":[";
	unsigned char *externalPortObject=(unsigned char*)constExternalPortObjectStart;
	while(*externalPortObject){
		*getExternalPortObject=*externalPortObject;
		getExternalPortObject++;
		externalPortObject++;
	}
	externalPortLength=0;
	while(externalPortLength<EXTERNAL_PORT_LENGTH){
		externalPortObject=inttostring(externalPortBuffer[externalPortLength++]);
		while(*externalPortObject){
			*getExternalPortObject=*externalPortObject;
			getExternalPortObject++;
			externalPortObject++;
		}
		*getExternalPortObject=0x2C*(externalPortLength<EXTERNAL_PORT_LENGTH);
		getExternalPortObject+=(externalPortLength<EXTERNAL_PORT_LENGTH);
	}
	*getExternalPortObject=0x5D;
	getExternalPortObject++;
	*getExternalPortObject=0x7D;
	getExternalPortObject++;

	return EEPROM_BUFFER;
}

unsigned char *externalPortSet(unsigned char *externalPortArrayObject){
	unsigned char *orgLocation=externalPortArrayObject;
	unsigned char *finalInt;
	unsigned char arrayIndexBuffer[19]="externalPort[";
	unsigned char *arrayIndexReset=arrayIndexBuffer+stringCounter(arrayIndexBuffer);
	if(json("externalPort",externalPortArrayObject)!=UNDEFINED){
		EXTERNAL_PORT_SET_COUNTER++;
		unsigned short startAddress=EXTERNAL_PORT_CONFIG;
		unsigned char arrayIndex=0;
		while(startAddress<EXTERNAL_PORT_CONFIG+EXTERNAL_PORT_LENGTH){
			unsigned char *mkIndexStr=arrayIndexReset;
			CLR(mkIndexStr);
			unsigned char *arrayIndexStr=inttostring(arrayIndex++);
			while(*arrayIndexStr){
				*mkIndexStr=*arrayIndexStr;
				mkIndexStr++;
				arrayIndexStr++;
			}
			*mkIndexStr=0x5D;
			mkIndexStr++;
			if((finalInt=json(arrayIndexBuffer,externalPortArrayObject))!=UNDEFINED){
				EEPROM.write(startAddress&((MAX_EEPROM_SIZE-1)),(strint(finalInt)&0xff));
			}
			startAddress++;
		}
		EEPROM.commit();
	}
	return orgLocation;
}

unsigned char *externalPortBitToggle(unsigned char bitNumber){
	unsigned char bitValue=1<<(bitNumber%8);
	unsigned char byteIndex=EXTERNAL_PORT_CONFIG+(bitNumber/8)%8;
	EEPROM.write(byteIndex,(EEPROM.read(byteIndex)^bitValue));
	EEPROM.commit();
	EXTERNAL_PORT_SET_COUNTER++;
	return externalPort();
}

unsigned char FIRST_RUN=0;
void eepromInit(void){
	EEPROM.begin(MAX_EEPROM_SIZE);
	if(EEPROM.read((MAX_EEPROM_SIZE-1))==0xFF){
		for(unsigned short clearCounter=0;clearCounter<MAX_EEPROM_SIZE;clearCounter++){
			EEPROM.write(clearCounter,0);
		}
		EEPROM.commit();
		FIRST_RUN=1;
		wifiPasswordSave((unsigned char*)"12345678");
		linkerSave(UNDEFINED);
	}
	return;
}


unsigned char *scanForWifi(unsigned char *networksObject){
	unsigned char *orgLocation=networksObject;
	int n = WiFi.scanNetworks();
	const unsigned char baseStr[14]="{\"network\":[\"";
	unsigned char *makeBaseStr=(unsigned char *)baseStr;
	while(*makeBaseStr){
		*networksObject=(*makeBaseStr);
		makeBaseStr++;
		networksObject++;
	}
	for (unsigned char i = 0; i < n; ++i) {
		
		unsigned char scannedSSIDLength=WiFi.SSID(i).length();
		for(unsigned char makeObject=0;makeObject<scannedSSIDLength;makeObject++){
			*networksObject=WiFi.SSID(i)[makeObject];
			networksObject++;
		}

		*networksObject=0x22;
		networksObject++;
		*networksObject=0x2C;
		networksObject++;

		unsigned char *scannedRSSI=longToString(WiFi.RSSI(i));
		unsigned char avoidErrorCounter=0;
		while(*scannedRSSI&&avoidErrorCounter<3){
			*networksObject=(*scannedRSSI);
			scannedRSSI++;
			networksObject++;
			avoidErrorCounter++;
		}

		if(i!=(n-1)){
			*networksObject=0x2C;
			networksObject++;
			*networksObject=0x22;
			networksObject++;
		}
	}
	*networksObject=0x5D;
	networksObject++;
	*networksObject=0x7D;
	networksObject++;

	while(*networksObject){
		*networksObject=0;
		networksObject++;
	}


	
	return orgLocation;
}

unsigned short networkConnect(void){
	unsigned char *ssid=userSSID();
	unsigned char *password=userPassword();
	unsigned short exitStatus;
	WiFi.mode(WIFI_STA);
	WiFi.softAP("",(char*)password);
	WiFi.softAP((char*)ipAddressString(WiFi.softAPIP()),(char*)password);
	if(stringCounter(ssid)){
		WiFi.begin((char*)ssid,(char*)password);
		unsigned short connectTimeout=0x8000;
		while ((exitStatus=WiFi.status()) != WL_CONNECTED){
			//ESP.wdtFeed();
			if(!connectTimeout){
				// WiFi.disconnect();
				return exitStatus;
			}
			_delay_ms(1);
			connectTimeout++;
		}
		WiFi.setAutoReconnect(true);
		WiFi.persistent(true);
		WiFi.softAP((char*)ipAddressString(WiFi.localIP()),(char*)password);
	}
	return exitStatus;
}


unsigned char *tcpGetString(WiFiClient &client,unsigned char *memoryBuffer){
	unsigned char *tcpBuffer=memoryBuffer;
	while(client.available()){
		if(!(*memoryBuffer)){
			*memoryBuffer=client.read();
			memoryBuffer++;
		}	
		else{
			client.read();
		}
	}
	*memoryBuffer=0;
	return tcpBuffer;
}

unsigned char USER_KEY[21]="";

unsigned char serverConnect(WiFiClient &socket){
	unsigned char *remoteHostObject=linkerData();
	if((json("D",remoteHostObject)!=UNDEFINED)&&(json("P",remoteHostObject)!=UNDEFINED)&&(json("K",remoteHostObject)!=UNDEFINED)&&(json("U",remoteHostObject)!=UNDEFINED)){
		CLR(USER_KEY);
		unsigned char *mkUserKey=USER_KEY;
		unsigned char *getUserKey=base64Decode(json("K",remoteHostObject));
		while(*getUserKey){
			*mkUserKey=*getUserKey;
			mkUserKey++;
			getUserKey++;
		}
		unsigned short socketPort=strint(json("P",remoteHostObject));
		if(!(socket.connect((char*)json("D",remoteHostObject),socketPort))){
			socket.stop();
			consoleLog("failed to connect\n");
			return 0;
		}
		_delay_ms(150);
		socket.write((char*)json("U",remoteHostObject));
		socket.write("new xtensa connection");
		consoleLog("server connected\n");
		return 1;
	}
	consoleLog("invalid network object \n");
	return 0;
}

