John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
	if(urlParameters.secure){
		WiFiClientSecure client;
		client.setInsecure();
		if(!client.connect((char*)urlParameters.domain,urlParameters.port)){
			consoleLog("couldn't connect !!\n");
			return UNDEFINED;
		}
		client.write((char*)responseBuffer);
		CLR(responseBuffer);
		while(!client.available());
		unsigned char *makeStr=responseBuffer;
		unsigned long memoryLimter=0;
		while(client.available()){
			if(memoryLimter<fetchMemoryLimiter){
				*makeStr=client.read();
				makeStr++;
			}
			else{
				client.read();
			}
			memoryLimter++;
		}
		makeStr=responseBuffer;
	}
	else{
		WiFiClient client;
		if(!client.connect((char*)urlParameters.domain,urlParameters.port)){
			consoleLog("couldn't connect !!\n");
			return UNDEFINED;
		}
		client.write((char*)responseBuffer);
		CLR(responseBuffer);
		while(!client.available());
		unsigned char *makeStr=responseBuffer;
		unsigned long memoryLimter=0;
		while(client.available()){
			if(memoryLimter<fetchMemoryLimiter){
				*makeStr=client.read();
				makeStr++;
			}
			else{
				client.read();
			}
			memoryLimter++;
		}
		makeStr=responseBuffer;
	}

	return returnedBuffer;
}



unsigned char nextClient(unsigned char allClients){
	for(unsigned char i=0;i<8;i++){
		if(!(allClients&(1<<i)))
			return i;
	}
	return (-1U);
}

void hw_wdt_disable(){
	*((volatile uint32_t*) 0x60000900) &= ~(1); // Hardware WDT OFF
//	volatile uint32_t *watchDogRegister=((volatile uint32_t*) 0x60000900);
//	*watchDogRegister &= ~(1);
}

void hw_wdt_enable(){
	*((volatile uint32_t*) 0x60000900) |= 1; // Hardware WDT ON
}

void setup() {
	// ESP.wdtDisable();
	hw_wdt_disable();
}

void loop() {
	main();
}


#define REMOTE_HOST "192.168.1.130"
#define REMOTE_PORT 80U
#define GENERAL_RESPONSE "HTTP/1.1 200 OK\r\nAccess-Control-Allow-Origin: *\r\nAccess-Control-Allow-Headers: *\r\n\r\nSk9ITiBLSEFMSUw=\r\n"
#define CORS_HEADERS (char *)"HTTP/1.1 200 OK\r\nAccess-Control-Allow-Origin: *\r\nAccess-Control-Allow-Headers: *\r\n\r\n"
#define CLIENT_ACK "REQUEST_ACK\r\n"

#define EXPORTED_DATA_MAX_SIZE 10240UL
unsigned char EXPORTED_DATA[EXPORTED_DATA_MAX_SIZE]="";


int main(void){
    disableAutoReset();
	eepromInit();
	spiConsoleSetup();
	static unsigned short lastNetworkStat;

	// unsigned char fileSystemMounted=1;
	// if(!fileSystem.begin()){
	// 	fileSystemMounted=0;
	// 	consoleLog("cannot mount FileSystem\r\n");
	// }

	spiConsole console;
	console.setup(clk,data,microSec,360000);
// 
// 
	// console.log("test >> ", 5012);

	

	consoleLog("\nserial port\n");



	const char *ssid="RISC-V";
	const char *password="threadripper";
	ssidSave((unsigned char*)ssid);
	wifiPasswordSave((unsigned char*)password);
	consoleLog(userSSID());
	consoleLog("\nserial port\n");
	consoleLog(userPassword());
	consoleLog("\nserial port\n");
	
	externalPort();
	lastNetworkStat=networkConnect();
	consoleLog(inttostring(lastNetworkStat==WL_CONNECTED));
 	consoleLog(" connected\n");
	unsigned char networkWasConnect=(lastNetworkStat==WL_CONNECTED);

	WiFiServer server(80);
	server.begin();


	WiFiClient socket;
	//socket.connect(REMOTE_HOST,REMOTE_PORT);
	socket.setTimeout(5000);
	// linkerSave((unsigned char*)"{\"D\":\"xtensa32plus.ddns.net\",\"P\":50,\"K\":\"0123456789123456\",\"U\":{\"auth\":\"test0\"}}");
	unsigned char serverConnected=serverConnect(socket);
	uint64_t lastServerTime=0;

	WiFiClient client;
	client.setTimeout(5000);

	#define enc(_RAWTEXT) tcps((unsigned char*)_RAWTEXT,USER_KEY,EXPORTED_DATA)
	unsigned char *_serverData;// not to call a pointer returnning func twice
	#define SERVER_SEND(serverData)_serverData=serverData; if(serverConnected){socket.write((char*)enc(_serverData));dataMask((unsigned char*)_serverData,USER_KEY);CLR(EXPORTED_DATA);}

	#define remoteUserData 0x00010000UL
	#define remoteUserDisconnected 0x00020000UL
	#define portListener 0x00040000UL
	#define clientDisconnected 0x00080000UL

	unsigned long eventListener=0;
	unsigned long staticListener=0;
	unsigned char clientJustConnected=0; //this method might lead to lots of synchronization problems but in a very few conditions
	unsigned char socketConnection=0;
	
	consoleLog("start the loop\n");
	while(1){
		eventListener=0;
		unsigned short reconnectTimer=0;
		#define NETWORK_BUFFER_SIZE 2048
		unsigned char tcpText[NETWORK_BUFFER_SIZE]="";

		while(1){
			//ESP.wdtFeed();
			if(lastNetworkStat!=WiFi.status()){ //network event listener -auto handle
				lastNetworkStat=WiFi.status();
				if(lastNetworkStat==WL_CONNECTED){
					networkWasConnect=1;
					WiFi.softAP((char*)ipAddressString(WiFi.localIP()),(char*)userPassword());
				}
				else if(networkWasConnect){ //open up an access point with the matching ip address 
					networkWasConnect=0;
					WiFi.softAP("",(char*)userPassword());
					WiFi.softAP((char*)ipAddressString(WiFi.softAPIP()),(char*)userPassword());
				}
			}
			if(!clientJustConnected&&(!socketConnection)){//if there was a connection it would tell new connection simply to fuck off
				if(client=server.available()){
					clientJustConnected=1;
				}
			}
			if((clientJustConnected||socketConnection)&&(client.available())){
				clientJustConnected=0;
				eventListener|=portListener;
				staticListener|=portListener;
			}
			if(socketConnection&&(!client.connected())){
				socketConnection=0;
				eventListener|=clientDisconnected;
				staticListener|=clientDisconnected;
			}

			if(socket.available()&&serverConnected){
				tcpText[NETWORK_BUFFER_SIZE-1]=0xFF;
				dataMask(base64Decode(tcpGetString(socket,tcpText)),base64Decode(json("K",linkerData())));
				if(!lastServerTime){
					lastServerTime=getInt(json("time",tcpText));
					CLR(tcpText);
				}
				else if(getInt(json("time",tcpText))>lastServerTime){
					lastServerTime=getInt(json("time",tcpText));

					unsigned char timeDigits=stringCounter(json("time",tcpText))+9;
					CLR(tcpText+(stringCounter(tcpText)-timeDigits));
					unsigned char *orgLoc=tcpText;
					unsigned char *dataLoc=tcpText+8;
					while(*dataLoc){
						*orgLoc=*dataLoc;
						dataLoc++;
						orgLoc++;
					}
					CLR(orgLoc);

					eventListener|=remoteUserData;
					staticListener|=remoteUserData;
				}
				else
					CLR(tcpText);
			}
			if(!(--reconnectTimer)){
				unsigned char *remoteHostObject=linkerData();
				static unsigned char remoteConnectionResetTimer;
				if(!(--remoteConnectionResetTimer)&&serverConnected)
					socket.write("Sk9ITiBLSEFMSUw=");
				if((json("D",remoteHostObject)!=UNDEFINED)&&(json("P",remoteHostObject)!=UNDEFINED)&&(json("K",remoteHostObject)!=UNDEFINED)&&(json("U",remoteHostObject)!=UNDEFINED)){
					if(!serverConnected)
						serverConnected=serverConnect(socket);
					else if(!(serverConnected=socket.connected()))
						consoleLog("server disconnected\n");
						//socket.stop();
				}
			}

			if(eventListener)
				break;
		}




		ALL_EVENTS_HANDLER:
		
		
		unsigned char *exportedData=EXPORTED_DATA;
		CLR(exportedData);

		if(eventListener&portListener){

			unsigned char *makeStr=tcpText;
			unsigned long memoryLimter=0;
			while(client.available()){
				if(memoryLimter<(NETWORK_BUFFER_SIZE-1)){
					*makeStr=client.read();
					makeStr++;
				}
				else{
					client.read();
				}
				memoryLimter++;
			}
			makeStr=tcpText;

			if(socketConnection){
				webSocketDataFrame(tcpText,FRAME_DECODE);
				if(WEBSOCKET_LAST_OPCODE==9){
					unsigned char *webSocketPongFrame=webSocketDataFrame(tcpText,FRAME_ENCODE);
					webSocketPongFrame[0]=0x8A;
					_delay_ms(1);
					client.write((char*)webSocketPongFrame);
					CLR(tcpText);
					CLR(webSocketPongFrame);
					continue;
				}
				//client.write((char*)webSocketDataFrame(tcpText,FRAME_ENCODE));
			}
			else{
				if(!((eventIdentifier(tcpText)&WEB_SERVER)==WEB_SERVER))
					URIdecode(tcpText);
			}
			
