John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
			consoleLog(tcpText);
			consoleLog("\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n");



			unsigned char eventType=eventIdentifier(tcpText);


			if((eventType&WEB_SOCKET)==WEB_SOCKET){// never wanna mess with this line
				consoleLog("user data >> ");
				consoleLog(eventData(EVENT_DATA,tcpText,(unsigned char*)"\r\n"));
				consoleLog("\n");

				socketConnection=1;
				client.write("HTTP/1.1 101 Switching Protocols\r\n");
				client.write("Upgrade: websocket\r\n");
				client.write("Connection: Upgrade\r\n");
				client.write("Sec-WebSocket-Accept: ");
				client.write((char*)secWebSocketAccept(tcpText));
				client.write("\r\n\r\n");
			}

			
			// else if(((eventType&WEB_SERVER)==WEB_SERVER)&&(!socketConnection)){
			// 	unsigned char *filePath=URIdecode(eventData(EVENT_DATA,tcpText,(unsigned char*)" HTTP/"));
			// 	consoleLog("filePath >> ");
			// 	consoleLog(filePath);
			// 	consoleLog(_endl);
				
			// 	if(fileSystemMounted){_WDF;
			// 		client.write(CORS_HEADERS);
			// 		unsigned char *finalFilePath=filePath;
			// 		unsigned char homePageHTML[19]="/oscilloscope.html";
			// 		if(equalStrings(filePath,(unsigned char*)"/")||(!stringCounter(filePath)))
			// 			finalFilePath=homePageHTML;
			// 		File xtensaFile=fileSystem.open((char*)finalFilePath,"r");
			// 		while(1){_WDF;
			// 			unsigned short webPageBuffer=4069;
			// 			unsigned char *mkWebPageBuffer=exportedData;
			// 			while((--webPageBuffer)&&xtensaFile.available()){_WDF;
			// 				*mkWebPageBuffer=(unsigned char)xtensaFile.read();
			// 				mkWebPageBuffer++;
			// 			}
			// 			client.write((char *)exportedData);
			// 			CLR(exportedData);
			// 			if(webPageBuffer)
			// 				break;
			// 		}
			// 		client.flush();
			// 		client.stop();
			// 		xtensaFile.close();
			// 	}
			// 	else{
			// 		client.write(GENERAL_RESPONSE);
			// 		client.flush();
			// 		client.stop();
			// 	}
			// 	CLR(tcpText);
			// 	CLR(filePath);
			// }



			else if((eventType&UPLOADED_DATA)==UPLOADED_DATA){
				#define SCAN_FOR_WIFI 0x00000001UL
				#define NETWORK_DATA 0x00000002UL
				#define LOGIC_ANALIZER 0x00000004UL
				#define SUPER_SPEED_SAMPLE 0x00000008UL
				#define ENABLE_SERIAL_PORT 0x00000010UL
				#define SERVER_DATA 0x00000020UL
				#define EXTERNAL_PORT 0x00000040UL
				#define EXTERNAL_PORT_LIVE 0x00000100UL

				consoleLog("user data >> ");
				consoleLog(eventData(EVENT_DATA,tcpText,(unsigned char*)"<@>"));
				consoleLog("\n");

				unsigned char *instructionDecode=json("instruction",tcpText);
				if(instructionDecode!=UNDEFINED){
					unsigned long userInstruction=strint(instructionDecode);
					consoleLog("user instruction >> ");
					consoleLog(intToHexaDecimal(userInstruction));
					consoleLog("\n");
					
					if(userInstruction&SCAN_FOR_WIFI){
						if(socketConnection){
							client.write((char*)webSocketDataFrame(scanForWifi(exportedData),FRAME_ENCODE));
						}
						else{
							client.write(CORS_HEADERS);
							client.write((char*)scanForWifi(exportedData));
							client.flush();
							client.stop();
						}
						CLR(exportedData);
					}

					if(userInstruction&NETWORK_DATA){
						ssidSave(json("networkSSID",tcpText));
						wifiPasswordSave(json("networkPASS",tcpText));
						if(socketConnection){
							client.write((char*)webSocketDataFrame((unsigned char*)CLIENT_ACK,FRAME_ENCODE));
						}
						else{
							client.write(CORS_HEADERS);
							client.write(CLIENT_ACK);
							client.flush();
							client.stop();
						}
						lastNetworkStat=networkConnect();
						networkWasConnect=(lastNetworkStat==WL_CONNECTED);
					}

					if((userInstruction&SERVER_DATA)&&(!socketConnection)){
						unsigned char *serverConfig;
						client.write(CORS_HEADERS);
						if((serverConfig=json("serverData",tcpText))!=UNDEFINED)
							linkerSave(serverConfig);
						client.write((char*)linkerData());
						client.flush();
						client.stop();
					}

					if(userInstruction&EXTERNAL_PORT){
						unsigned char *checkLastServerTime;
						if((checkLastServerTime=json("lastServerTime",tcpText))!=UNDEFINED){
							uint64_t externalPortInstructionOrder=getInt(checkLastServerTime);
							if(externalPortInstructionOrder!=lastServerTime){
								lastServerTime=externalPortInstructionOrder;
								externalPortSet(tcpText);
								unsigned char *extPrtDirectBit;
								if((extPrtDirectBit=json("extPrtDirectBit",tcpText))!=UNDEFINED){
									externalPortBitToggle(getInt(extPrtDirectBit));
								}
							}
						}
						SERVER_SEND(externalPort());
						if(socketConnection){
							client.write((char*)webSocketDataFrame(externalPort(),FRAME_ENCODE));
						}
						else{
							client.write(CORS_HEADERS);
							client.write((char*)externalPort());
							client.flush();
							client.stop();
						}
					}
					
					if((userInstruction&EXTERNAL_PORT_LIVE)&&socketConnection){

						while(client.connected()){
							if(client.available()){
								unsigned char *makeStr=exportedData;
								unsigned long memoryLimter=0;
								while(client.available()){
									if(memoryLimter<(EXPORTED_DATA_MAX_SIZE-1)){
										*makeStr=client.read();
										makeStr++;
									}
									else{
										client.read();
									}
									memoryLimter++;
								}
								makeStr=exportedData;
								webSocketDataFrame(exportedData,FRAME_DECODE);

								unsigned char *liveExternalPortObject;
								if((liveExternalPortObject=json("liveExternalPort",exportedData))!=UNDEFINED){
									uint64_t liveExternalPort=getInt(liveExternalPortObject);
									unsigned long livePortBitCounter=32;											//limited to 4 bytes
									while(livePortBitCounter--){
										_DW(shiftRegisterData,((liveExternalPort&(1<<livePortBitCounter))!=0));		// !=0 not necessary but it only works that way 
										_DW(shiftRegisterClk,1);
										_delay_us(EXTERNAL_OUTPUT_SPEED);
										_DW(shiftRegisterClk,0);
										_delay_us(EXTERNAL_OUTPUT_SPEED);
									}
									_DW(shiftRegisterData,0);
									_DW(shiftRegisterLatch,1);
									_delay_us(EXTERNAL_OUTPUT_SPEED*10);
									_DW(shiftRegisterLatch,0);
									_delay_us(EXTERNAL_OUTPUT_SPEED);
								}

								else if(json("JRM",exportedData)!=UNDEFINED){
									unsigned char *xtensaJrm=exportedData+9;
									unsigned short clearTextSize=stringCounter(xtensaJrm);
									base64Decode(xtensaJrm);					//JRM is not turing complete
									#define JRM_OPERAND(OPERAND_POINTER) (unsigned long)((xtensaJrm[(OPERAND_POINTER*4)+3]|(xtensaJrm[(OPERAND_POINTER*4)+2]<<8)|(xtensaJrm[(OPERAND_POINTER*4)+1]<<16)|(xtensaJrm[OPERAND_POINTER*4]<<24))&0x3FFFFFFF)
									#define JRM_OPCODE(OPCODE_POINTER) (xtensaJrm[OPCODE_POINTER*4]>>6)
									
