John-Khalil/ESP32/executable/NodeTcpTestServerComplete.cpp
									#define _output 		0
									#define _delay 			1
									#define _pointerSet 	2
									#define _endOfStack 	3

									unsigned short stackPointer=0;
									unsigned short stackLimiter=-1;
									while(stackLimiter--){
										unsigned char opCode=JRM_OPCODE(stackPointer);
										unsigned long operand=JRM_OPERAND(stackPointer);
										stackPointer++;
										if(opCode==_output){
											const float JRM_PORT_SPEED=(1e6f/1000000)/2;
											unsigned long livePortBitCounter=30;											//30 bits in total 
											while(livePortBitCounter--){
												_DW(shiftRegisterData,((operand&(1<<livePortBitCounter))!=0));		// !=0 not necessary but it only works that way 
												_DW(shiftRegisterClk,1);
												_delay_us(JRM_PORT_SPEED);
												_DW(shiftRegisterClk,0);
												_delay_us(JRM_PORT_SPEED);
											}
											_DW(shiftRegisterData,0);
											_DW(shiftRegisterLatch,1);
											_delay_us(JRM_PORT_SPEED*10);
											_DW(shiftRegisterLatch,0);
											_delay_us(JRM_PORT_SPEED);
										}
										else if(opCode==_delay){
											_delay_us((operand&255));
										}
										else if(opCode==_pointerSet){
											// gpioStack[stackPointer]&=0xC000FFFFUL;
											// gpioStack[stackPointer]|=((operand>>16)-((operand>>16)!=0))<<16;
											unsigned short countPointerDown=((operand>>16)-((operand>>16)!=0));
											xtensaJrm[(stackPointer-1)*4]=0x80|(0x3f&((countPointerDown)>>8));
											xtensaJrm[((stackPointer-1)*4)+1]=countPointerDown&0xFF;
											if((operand>>16))
												stackPointer=(unsigned short)(operand&0xFFFF);
										}
										else if(opCode==_endOfStack){
											if(!operand)
												break;
											else{
												xtensaJrm[(stackPointer-2)*4]=xtensaJrm[(stackPointer-1)*4]&0xBF;
												xtensaJrm[((stackPointer-2)*4)+1]=xtensaJrm[((stackPointer-1)*4)+1];
												xtensaJrm[((stackPointer-2)*4)+2]=xtensaJrm[((stackPointer-1)*4)+2];
												xtensaJrm[((stackPointer-2)*4)+3]=xtensaJrm[((stackPointer-1)*4)+3];
											}
										}

										static unsigned char clientCallTimeOut;
										if(!(--clientCallTimeOut)){
											if(client.available())
												break;
											if(!(client.connected()))
												break;
										}


									}

									CLR_LENGTH=clearTextSize;
									CLR(xtensaJrm);_NOP();

								}

								// #define stackIdentifier "S"
								// else if((liveExternalPortObject=json(stackIdentifier,tcpText))!=UNDEFINED){WD_FEED;
								// 	unsigned short stackPointer=0;
								// 	unsigned char stackIdentifierList[20]=stackIdentifier;
								// 	stackIdentifierList[stringCounter(stackIdentifierList)]=0x5B;	//square bracket


								// }
								// CLR_LENGTH=EXPORTED_DATA_MAX_SIZE;
								CLR(exportedData);
							}
						}
						socketConnection=0;

						
					}

				}	
			}




			else if(!socketConnection){
				client.write(GENERAL_RESPONSE);
				client.flush();
				client.stop();
			}
			


			
		}

		if(eventListener&=remoteUserData){
			consoleLog("DATA FROM SERVER >> ");
			consoleLog(tcpText);
			consoleLog("\r\n");

			#define SERVRE_EXTERNAL_PORT 0x00000040UL
			#define SERVER_SYNC_EXTERNAL_PORT 0x00000080UL

			unsigned char *serverInstructionDecode;
			if((serverInstructionDecode=json("instruction",tcpText))!=UNDEFINED){
				unsigned long serverInstruction=getInt(serverInstructionDecode);

				if(serverInstruction&SERVRE_EXTERNAL_PORT){
					externalPortSet(tcpText);
					unsigned char *extPrtDirectBit;
					if((extPrtDirectBit=json("extPrtDirectBit",tcpText))!=UNDEFINED){
						SERVER_SEND(externalPortBitToggle(getInt(extPrtDirectBit)));		
					}
					else
						SERVER_SEND(externalPort());
				}

				if(serverInstruction&SERVER_SYNC_EXTERNAL_PORT){
					unsigned char *localPortValue=json("externalPort",externalPort());
					CLR(exportedData);
					unsigned char *localPortValueCopy=exportedData;
					while(*localPortValue){
						*localPortValueCopy=*localPortValue;
						localPortValue++;
						localPortValueCopy++;
					}
					if(!equalStrings(exportedData,json("externalPort",tcpText))){
						externalPortSet(tcpText);
						externalPort();
					}
					CLR(exportedData);
				}
			}
		}



		
	}
}